In [11]:
import pandas as pd
import numpy as np

orders = pd.read_csv('orders.csv')
display(orders.head())
# print(orders.head())

,id,first_name,last_name,email,shoe_type,shoe_material,shoe_color,price
0,97916,Douglas,Perez,DouglasPerez28@gmail.com,stilettos,fabric,brown,90
1,67691,Tiffany,O'neill,TiffanyO'neill51@gmail.com,wedges,leather,navy,94
2,72818,Susan,Rivas,Susan.Rivas@gmail.com,sandals,faux-leather,white,96
3,28080,Angela,Hopper,AngelaHopper62@outlook.com,stilettos,leather,red,96
4,89958,Thomas,Benjamin,TBenjamin1981@gmail.com,sandals,faux-leather,navy,97

In [12]:
pricey_shoes=orders.groupby('shoe_type').price.max().reset_index()
print(pricey_shoes)
# orders.head()

      shoe_type  price
0  ballet flats    498
1       sandals    498
2     stilettos    468
3        wedges    488

In [13]:
print(type(pricey_shoes))

<class 'pandas.core.frame.DataFrame'>

In [15]:
cheap_shoes=orders.groupby('shoe_color').price.apply(lambda x: np.percentile(x,25)).reset_index()
display(cheap_shoes)

  shoe_color  price
0      black  130.0
1      brown  248.0
2       navy  200.0
3        red  157.0
4      white  188.0

In [27]:
shoe_counts=orders.groupby(['shoe_type','shoe_color']).id.count().reset_index()
shoe_counts.rename(columns={'id':'Counts'}).head()

      shoe_type shoe_color  Counts
0  ballet flats      black       2
1  ballet flats      brown      11
2  ballet flats       navy      17
3  ballet flats        red      13
4  ballet flats      white       7

### Pivot Tables

In [30]:
shoe_counts = orders.groupby(['shoe_type', 'shoe_color']).id.count().reset_index()
shoe_counts_pivot=shoe_counts.pivot(
    columns='shoe_color',
    index='shoe_type',
    values='id').reset_index()
shoe_counts_pivot

shoe_color     shoe_type  black  brown  navy   red  white
0           ballet flats    2.0   11.0  17.0  13.0    7.0
1                sandals    3.0   10.0  13.0  14.0   10.0
2              stilettos    8.0   14.0   7.0  16.0    5.0
3                 wedges    NaN   13.0  16.0   4.0   17.0

### 
The column utm_source contains information about how users got to ShoeFlyâ€™s homepage. For instance, if utm_source = Facebook, then the user came to ShoeFly by clicking on an ad on Facebook.com.

Use a groupby statement to calculate how many visits came from each of the different sources. Save your answer to the variable click_source.

In [32]:
user_visits = pd.read_csv('page_visits.csv')
display(user_visits.head())
click_source=user_visits.groupby('utm_source').id.count().reset_index()

,id,first_name,last_name,email,month,utm_source
0,10043,Louis,Koch,LouisKoch43@gmail.com,3 - March,yahoo
1,10150,Bruce,Webb,BruceWebb44@outlook.com,3 - March,twitter
2,10155,Nicholas,Hoffman,Nicholas.Hoffman@gmail.com,2 - February,google
3,10178,William,Key,William.Key@outlook.com,3 - March,yahoo
4,10208,Karen,Bass,KB4971@gmail.com,2 - February,google

### 4.
Our Marketing department thinks that the traffic to our site has been changing over the past few months. Use groupby to calculate the number of visits to our site from each utm_source for each month. Save your answer to the variable click_source_by_month.

In [33]:
click_source_by_month=user_visits.groupby(['utm_source','month']).id.count().reset_index()
print(click_source_by_month)

   utm_source         month   id
0       email   1 - January   43
1       email  2 - February  147
2       email     3 - March  272
3    facebook   1 - January  404
4    facebook  2 - February  263
5    facebook     3 - March  156
6      google   1 - January  127
7      google  2 - February  196
8      google     3 - March  220
9     twitter   1 - January  164
10    twitter  2 - February  154
11    twitter     3 - March   97
12      yahoo   1 - January  262
13      yahoo  2 - February  240
14      yahoo     3 - March  255

### 5.
The head of Marketing is complaining that this table is hard to read. Use pivot to create a pivot table where the rows are utm_source and the columns are month. Save your results to the variable click_source_by_month_pivot.

In [34]:
click_source_by_month_pivot=click_source_by_month.pivot(columns='month',
index='utm_source',
values='id').reset_index()
display(click_source_by_month_pivot)

month utm_source  1 - January  2 - February  3 - March
0          email           43           147        272
1       facebook          404           263        156
2         google          127           196        220
3        twitter          164           154         97
4          yahoo          262           240        255